Тест_ЗУП_31_КОРП/src/InformationRegisters/ИдентификаторыEStaff/ИдентификаторыEStaff.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИдентификаторыEStaff</name>
  <dimensions>
    <name>ИдентификаторОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектСсылка</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.ИсточникиИнформацииОКандидатах</types>
      <types>CatalogRef.ГруппыДоступаФизическихЛиц</types>
      <types>CatalogRef.Валюты</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
      <types>CatalogRef.Кандидаты</types>
      <types>CatalogRef.Вакансии</types>
      <types>CatalogRef.ПричиныОткрытияВакансий</types>
      <types>CatalogRef.ШтатноеРасписание</types>
      <types>CatalogRef.ЯзыкиНародовМира</types>
      <types>CatalogRef.СтраныМира</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест_ЗУП_31_КОРП/src/InformationRegisters/ИдентификаторыEStaff/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ОбъектПоИдентификатору(Идентификатор) Экспорт
	
	Объект = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ИдентификаторыEStaff.ИдентификаторОбъекта КАК Идентификатор,
	|	ИдентификаторыEStaff.ОбъектСсылка КАК Ссылка
	|ИЗ
	|	РегистрСведений.ИдентификаторыEStaff КАК ИдентификаторыEStaff
	|ГДЕ
	|	ИдентификаторыEStaff.ИдентификаторОбъекта = &Идентификатор";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Объект = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Объект;
	
КонецФункции

#КонецОбласти

#КонецЕсли
